// Index Properties ==================
// Індексаційні властивості дозволяють вам визначити тип об'єкта, який може бути доступний за допомогою індексації
// Це може бути корисно, коли ви хочете створити об'єкт, який може мати різні властивості
// або коли ви хочете створити об'єкт, який може мати різні типи даних
// Індексаційні властивості можуть бути реалізовані за допомогою операторів [key: string]: type або [key: number]: type

type Person2 = {
  name: string;
  [x: string]: string;
};

const user2: Person2 = {
  name: "Alex",
  gender: "MAN",
  country: "Ukraine",
};
